#pragma once
#include <iostream>

using namespace std;

class gameproblem
{
public:
	gameproblem()
	{
		cout << endl;
		cout << "                                            ※게임 문제※                               " << endl;
		cout << endl;
		cout << "1. 아시아 침략에 앞장선 이토 히로부미를 사살한 우리나라의 독립운동가는 누구일까요 ?" << endl;
		cout << "2. 조선시대의 장군으로 임진왜란에서 수군을 이끌고 전투마다 승리를 거두어 왜군을 물리치는데 큰 공을 세운 장군은 누구일까요 ? " << endl;
		cout << "3. 조선을 대표하는 최고의 성군으로 칭송받으며, 훈민정음을 창제하신 조선 제 4대 국왕은 누구일까요 ? " << endl;
		cout << "4. 일제강점기 시절 아우내 장터에서 군중에게 태극기를 나눠주는 등 만세시위를 주도하다가 체포된 독립운동가는 누구일까요 ? " << endl;
		cout << "5. 을지문덕 장군이 수나라의 30만 대군을 몰살시켜 크게 승리한 이 전투의 이름은 무엇일까요 ? " << endl;
		cout << "6. 삼국시대 고루려/신라/백제 중 가장 먼저 전성기를 맞은 나라는?" << endl;
		cout << "7. 고려 시대 현종 때 강감찬 장군이 거란 침략군에 맞서 싸워 침입을 막았는데요.이 대첩은 무엇일까요 ? " << endl;
		cout << "8. 신라 최초의 여왕은 누구일까요?" << endl;
		cout << "9. 국권 회복을 위해 1907년 안창호, 양기탁 등이 주축이 되어 결성한 비밀결사 단체 000은 무엇일까요 ? " << endl;
		cout << "10. 고려 제 31대 왕으로 반원 자주 정책을 추진했으며, 신진 세력을 등용하여 권문세족을 누르고 왕권을 강화시키려 한 왕의 이름은 ? " << endl;
		cout << "11. 동아시아 궁전 건축사에 있어 비정형적 조형미를 간직한 대표적인 궁으로 나라에 전쟁이나 큰 재난이 일어나 공식 궁궐을 사용하지" << endl;;
		cout << "    못할 때를 대비하여 지은 궁궐이다. 1997년 유네스코가 선정한 세계문화유산으로 등재된 이 궁의 이름은 ? " << endl;


	}

	~gameproblem(){}
};

int main()
{
	gameproblem P;
	P;





	return 0;
}