#pragma once
#include <iostream>

using namespace std;

class gameproblem3
{
public:
	gameproblem3()
	{
		cout << endl;
		cout << "                                            ※게임 문제※                               " << endl;
		cout << endl;
		cout << "1. 흥선 대원군은 우리 나라 여러 곳에 서양과의 교섭을 금지하는 글을 적은 비석을 세웠는데 이를 무엇이라고 하는가?" << endl;
		cout << "2. 외세의 침입으로부터 나라를 지키기 위해 근대적인 무기를 가지고 새로운 훈련을 받는 군대를 조직하였는데 이 군대의 이름은?" << endl;
		cout << "3. 대우를 잘 받지 못하는 구식 군인들의 불만이 폭발하여 일어난 사건은 무엇인가?" << endl;
		cout << "4. 미국 선교사로 언어학자이며 사학자였고, 육영 공원의 교수로 초빙되었으며, 우리 나라의 주권 회복 운동에 크게 활약한 사람은?" << endl;
		cout << "5. '사람이 곧 하늘이다.'라는 인간 중심 사상에 뿌리를 두고 국민들에게 애국심을 불어넣은 종교는 무엇인가?" << endl;
		cout << "6. 우리 나라 최초의 근대식 의료 기관은 무엇인가?" << endl;
		cout << "7. 우리 나라 최초로 만들어진 철교는 무엇인가? " << endl;
		cout << "8. 일본 왕의 생일을 기념하는 행사에 도시락 폭탄을 던져 여러 중요 인물을 죽이거나 크게 다치게 하고 순국한 분은 누구인가?" << endl;
		cout << "9. 1919년 일제의 주요 기관을 파괴하고 일본 관리를 암살할 목적으로 만주 길림성에서 조직된 단체는 무엇인가?" << endl;
		cout << "10. 조선 물건 쓰기 운동을 적극적으로 후원했던 당시의 신문사는 어디였는가?" << endl;
		cout << "11. 일제 시대 때 음악 활동을 한 사람 중에서 애국가를 작곡한 사람은 누구인가?" << endl;
		cout << "12. 임시 정부의 주석으로 한인 애국단을 조직하여 독립 운동을 한 분은 누구인가?" << endl;
		cout << "13. 일제는 3.1운동을 통해 우리 민족을 무력으로 지배할 수 없다는 것을 깨닫고, 식민 통치 정책을 바꾸었는데 이를 무엇이라고 하는가?" << endl;
		cout << "14. 조선 말기에 우리 한글을 보급하고 발전시키기 위해서 가장 많은 공을 세운 사람은 누구인가?" << endl;
		cout << "15. 안창호 선생이 나라의 힘을 기르는 방법은 교육을 통해서 백성들을 깨우치는 것이라 생각하고 평양에 세운 학교는 무엇인가?" << endl;
		cout << endl;
		cout << endl;
		cout << endl;
		cout << endl;
	}

	~gameproblem3() {}
};

int main()
{
	gameproblem3 P3;
	P3;





	return 0;
}
